www/templates/File Chunking - Load File Data.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:localhost-paint" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:handleRequest>
			<contextId xsi:type="xsd:string">01234567890</contextId>
			<className xsi:type="xsd:string">bus_facade_campaign_list</className>
			<processName xsi:type="xsd:string">loadFileData</processName>
			<entityData xsi:type="ns2:Map">
				<item>
				  <key xsi:type="xsd:string">listName</key>
                  <value xsi:type="xsd:string">temp_list_name</value>
				</item>
              	<item>
					<key xsi:type="xsd:string">uploadFileCategory</key>
                  <value xsi:type="xsd:string">PAINT</value>
				</item>
              	<item>
					<key xsi:type="xsd:string">uploadFileName</key>
                  <value xsi:type="xsd:string">temp_file_name</value>
				</item>
              	<item>
					<key xsi:type="xsd:string">overwriteExistingInd</key>
                  <value xsi:type="xsd:string">Y</value>
				</item>
			</entityData>
			<processData xsi:nil="true"/>
		</ns1:handleRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>